Revit 2020 API
Units.GetFormatOptions Method
 Gets the default FormatOptions for a unit type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public FormatOptions GetFormatOptions(
	UnitType unitType
)
Visual Basic
Public Function GetFormatOptions ( _
	unitType As UnitType _
) As FormatOptions
Visual C++
public:
FormatOptions^ GetFormatOptions(
	UnitType unitType
)
Parameters
unitType
Type: Autodesk.Revit.DB.UnitType
 The unit type.
Return Value
 A copy of the FormatOptions.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  unitType is an invalid unit type. See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Units Class
Autodesk.Revit.DB Namespace